window.addEventListener('DOMContentLoaded', function(){
  // let t = document.querySelector('.t');

  // t.addEventListener('touchstart', function(e){
  //   e.preventDefault();
  //   console.log('black box: touchstart');
  //   console.log(e.target);
  //   console.log(e.touches[0].target);
  //   console.log(e.changedTouches);
  //   console.log(e.targetTouches);
  // });

  // t.addEventListener('touchmove', function(e){
  //   e.preventDefault();
  //   console.log('black box: ' + e.touches[0].pageX);
  // });

  // t.addEventListener('touchend', function(e){
  //   e.preventDefault();
  //   console.log('black box: touchend');
  // });

  // =======================================================
  // =======================================================
  // =======================================================
  // =======================================================

  // new RegExp('pattern', 'flags');
  // /pattern/

  // let ans = prompt('Enter your name');

  // let reg = /n/gi;

  // console.log(ans.search(reg)); // search(reg) - поиск

  // console.log(ans.match(reg)); // match(reg) - совпадение

  // console.log(reg.test(ans)); // reg.test(ans) - выдаст булевое значение

  // =======================================================
  // =======================================================
  // =======================================================
  // =======================================================

  // ФЛАГИ
  // i - регистр (найти в не зависимости от регистра)
  // g - глобальность (найти все вхождения)
  // m - многострочность
  // . - искать или заменять любые символы в строке (/./g, '*') - заменены все сымволы на *


  // /-/g, ':'   -   '12-34-56'.replace(/-/g, ':') замена всех дефисов (-) на (:)

  // let pass = prompt('Enter your password');

  // console.log(pass.replace(/./g, '*'));
  
  // alert('12-34-56'.replace(/-/g, ':'));

  // =======================================================
  // =======================================================
  // =======================================================
  // =======================================================

  // \d - найти цифру
  // \w - найти букву
  // \s - найти пробел

  // \D - найти не цифру
  // \W - найти не букву
  // \S - найти не пробел

  // let ans = 'qw112ftt8';

  // let reg = /\d/g;

  //console.log(ans.match(reg)); // находим все цифры в строке - ["1", "1", "2", "8"]

  // =======================================================
  // =======================================================
  // =======================================================
  // =======================================================

  // let str = 'My name is/ R2D2';

  // str.match(/\w\d\w\d/i); // получаем, буква (\w), цифра, буква (\w), цифра (\d) - "R2"

  // str.match(/\//i); - найти слеш - экранируем (\) - находим (/)

});