

let heart = document.querySelectorAll('.heart'); 
let circle = document.querySelectorAll('.circle'); 
let div = document.createElement('div'); //создание элемента
let text = document.createTextNode('Hello World!'); //создание текстового узла

// ==========================================================
// ==========================================================
// ==========================================================

document.body.appendChild(div); // вставляем элемент в конец документа

// ==========================================================
// ==========================================================
// ==========================================================

document.body.insertBefore(text, heart[2]); //добавление текстового узла в DOM на 3-тью позицию в списке элементов heart

// ==========================================================
// ==========================================================
// ==========================================================

let menuItem = document.querySelectorAll('.menu-item'); // дети
let menu = document.querySelector('.menu'); // родитель
menu.insertBefore(menuItem[2], menuItem[1]); // Поменяли местами два элемента

// ==========================================================
// ==========================================================
// ==========================================================

document.body.removeChild(heart[1]); // удаление элемента со страницы

// ==========================================================
// ==========================================================
// ==========================================================

document.body.replaceChild(heart[0], circle[2]); // елемент heart переставляем на место circle

// ==========================================================
// ==========================================================
// ==========================================================

let a = document.documentElement.textContent; //получения всего текста + title и CDATA-данных во всём документе

// textContent позволяет писать текст «безопасным способом». С textContent вставка получается «как текст», все символы трактуются буквально.

// ==========================================================
// ==========================================================
// ==========================================================

elem.textContent = 'Пятый элемент'; //Добавление тес=кста к елементу

// ==========================================================
// ==========================================================
// ==========================================================


elem.outerHTML // получение элемента целиком  <div id="elem">Привет <b>Мир</b></div>

// ==========================================================
// ==========================================================
// ==========================================================

node.append(...nodes or strings) //– добавляет узлы или строки в конец node,
node.prepend(...nodes or strings) //– вставляет узлы или строки в начало node,
node.before(...nodes or strings) //–- вставляет узлы или строки до node,
node.after(...nodes or strings) //–- вставляет узлы или строки после node,
node.replaceWith(...nodes or strings) //–- заменяет node заданными узлами или строками.